app/views/devise/registrations/_form.html.erb

SELECT "universities".* FROM "universities"
---
              <%= s.label :university_id, 'Universidad' %>
              <%= s.select :university_id, University.all.map { |u| [u.university_name, u.id] }, { prompt: 'Por favor selecciona una opción' }, class: 'form-control input-width devie-control-margin-bot' %>

SELECT "majors".* FROM "majors"
---
              <%= s.label :major_id, 'Carrera'  %>
              <%= s.select :major_id, Major.all.map { |m| [m.major_name, m.id] }, { prompt: 'Por favor selecciona una opción' }, class: 'form-control input-width' %>