app/views/students/_student_display.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              <% if @student.user.role_id == 2 %>
                  <%= @student.user.first_name %>

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                        <td>
                          <% unless @student.user.student.gpa.blank?  %>

SELECT "learnt_languages".* FROM "learnt_languages" WHERE "learnt_languages"."student_id" = $1  [["student_id", 1]]
---
                        <tbody>
                        <% @student.user.student.learnt_languages.each do |learnt_language| %>

SELECT "tools".* FROM "tools" INNER JOIN "students_tools" ON "tools"."id" = "students_tools"."tool_id" WHERE "students_tools"."student_id" = $1  [["student_id", 1]]
---
                      <ul class="student-tools">
                        <% @student.user.student.tools.each do |tool| %>