app/views/users/_student_form.html.erb

SELECT "countries".* FROM "countries"
---
                <%= f.label :country_id, 'Pais' %><br>
                <%= f.select :country_id, Country.all.map { |country| [country.country_name, country.id] }, class: 'form-control input-width' %>

SELECT "cities".* FROM "cities"
---
                <%= f.label :city_id, 'Ciudad en la que vives' %><br>
                <%= f.select :city_id, City.all.map { |city| [city.city_name, city.id] }, { prompt: 'Por favor selecciona una opción' }, class: 'form-control input-width' %>

SELECT "universities".* FROM "universities"
---
                    <%= s.label :university_id, 'Universidad' %>
                    <%= s.select :university_id, University.all.map { |university| [university.university_name, university.id] }, { prompt: 'Por favor selecciona una opción' }, class: 'form-control input-width' %>

SELECT "majors".id FROM "majors" INNER JOIN "majors_students" ON "majors"."id" = "majors_students"."major_id" WHERE "majors_students"."student_id" = $1  [["student_id", 1]]
---
                    <%= s.label :major_id, 'Carrera'  %>
                    <%= s.select :major_id, Major.all.map { |major| [major.major_name, major.id] }, { prompt: 'Por favor selecciona una opción' }, class: 'form-control input-width' %>

SELECT "education_levels".* FROM "education_levels"
---
                    <%= s.label :ed_level_id, 'Nivel' %>
                    <%= s.select :ed_level_id, EducationLevel.all.map { |ed_level| [ed_level.level_name, ed_level.id] }, { prompt: 'Por favor selecciona una opción' }, class: 'form-control input-width' %>

SELECT  "students".* FROM "students" WHERE "students"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
                    <%= s.label :last_semester, 'Ultimo semestre cursado:' %>
                    <%= s.select :last_semester, Student::LAST_SEMESTER, { prompt: 'Por favor selecciona una opción' }, class: 'form-control input-width' %>

SELECT "tools".* FROM "tools"
---
                      <%= s.label :tools_ids, '¿Cuáles de estas herramientas sabes usar?' %>
                      <%= s.collection_check_boxes :tool_ids, Tool.all, :id, :tool_name do |b| %>