app/views/opportunities/index.html.erb

                  <% if opportunity.user.company.nil? %>
                      <%= "#{opportunity.user.first_name} #{opportunity.user.last_name}"  %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

                <td>
                  <% if opportunity.opportunity_duration.nil? ||opportunity.opportunity_duration.blank? %>
---
SELECT "opportunities".* FROM "opportunities" INNER JOIN majors_opportunities ON majors_opportunities.opportunity_id = opportunities.id WHERE ((majors_opportunities.major_id IN (157,NULL) OR other_majors = 't') AND approved_state = 't' AND closed = 'f')