app/views/opportunities/my_opportunities.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                      <% if opportunity.user.company.nil? %>
                          <%= "#{opportunity.user.first_name} #{opportunity.user.last_name}"  %>