app/controllers/opportunities_controller.rb

  def index
    # Used to check what type of role is signed in
    @user_role = User.find_by_id(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def my_opportunities
    # Used to check what type of role is signed in
    @user_role = User.find_by_id(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]