app/controllers/students_controller.rb

  def show
    id = params[:id].to_i
    # Used to check what type of role is signed in
    @user_role = User.find_by_id(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_student
    if user_signed_in?
      user_id = current_user.id
      @student = Student.find_by_user_id(user_id)
---
SELECT  "students".* FROM "students" WHERE "students"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]