app/controllers/users_controller.rb

  def edit
    @user = User.find_by_id(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find_by_id(current_user.id)

    respond_to do |format|
      if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "document_number" = $3, "mobile_phone" = $4, "country_id" = $5, "referenced_by" = $6, "other_city" = $7, "promo_id" = $8, "date_of_birth" = $9, "updated_at" = $10 WHERE "users"."id" = $11