app/views/layouts/_navbar.html.erb

SELECT "notification_posts".* FROM "notification_posts"
SELECT COUNT(*) FROM "notification_posts"
---
         <li class="dropdown bell_notification">
          <a href="#" class="dropdown-toggle" data-toggle="dropdown">  <i data-count="<%= NotificationPost.all.size  %>" class="glyphicon glyphicon-bell notification-icon"></i> </a>